#### Student’s Full Name: Anmol Tripathi
#### Course Title: SQL/NoSQL Databases for Data and Information Sciences
#### Term name and year: Fall 2023
#### Submission Week: 8
#### Instructor’s Name: Nayem Rahman
#### Date of Submission : 04/15/2023

In [1]:
import sqlite3
import pandas as pd

In [2]:
Worker = "Worker.db"

In [3]:
conn = sqlite3.connect(Worker)

In [4]:
conn = sqlite3.connect('/Users/HP/OneDrive/Desktop/SQL/Worker.db')

In [5]:
%load_ext sql

In [6]:
%load_ext sql


%sql sqlite:////Users/HP/OneDrive/Desktop/SQL/Worker.db

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

#### 1. Write a query using UNION to display EmployeeID, FirstName, and LastName from the Employee table. The first part of the SQL (i.e., the select statement before the UNION) should use the filter, EmployeeID, 1, 2, 3. The second part of the SQL (i.e., the select statement after the UNION) should use the filter, EmployeeID, 3, 4, 5. Make your observations on the results of the UNION query.

In [7]:
%%sql

SELECT EmployeeID, FirstName, LastName
FROM Employee
WHERE EmployeeID IN (1, 2, 3)

UNION

SELECT EmployeeID, FirstName, LastName
FROM Employee
WHERE EmployeeID IN (3, 4, 5);

 * sqlite:////Users/HP/OneDrive/Desktop/SQL/Worker.db
Done.

[(1, 'Andy', 'Wong'),
 (2, 'John', 'Wilson'),
 (3, 'Vivek', 'Pandey'),
 (4, 'Nola', 'Davis'),
 (5, 'Kathy', 'Cooper')]

#### 2. Write a query using UNION ALL to display EmployeeID, FirstName, and LastName from the Employee table. The first part of the SQL (i.e., the select statement before the UNION ALL) should use the filter, EmployeeID, 1, 2, 3. The second part of the SQL (i.e., the select statement after the UNION ALL) should use the filter, EmployeeID, 3, 4, 5.

#### Make your observations on the results of the UNION ALL query. How is the query result different from the query results in Question 1?

In [8]:
%%sql

SELECT EmployeeID, FirstName, LastName
FROM Employee
WHERE EmployeeID IN (1, 2, 3)

UNION ALL

SELECT EmployeeID, FirstName, LastName
FROM Employee
WHERE EmployeeID IN (3, 4, 5);

 * sqlite:////Users/HP/OneDrive/Desktop/SQL/Worker.db
Done.

[(1, 'Andy', 'Wong'),
 (2, 'John', 'Wilson'),
 (3, 'Vivek', 'Pandey'),
 (3, 'Vivek', 'Pandey'),
 (4, 'Nola', 'Davis'),
 (5, 'Kathy', 'Cooper')]

#### 3. Write a query to display the EmployeeID and total EquipmentCostAmount for each employee. Sort the results by EmployeeID. (Employee, EmployeeEquipment, Equipment tables).

In [9]:
%%sql

SELECT E.EmployeeID, SUM(EquipmentCostAmount) AS TotalEquipmentCost
FROM Employee E
JOIN EmployeeEquipment EE ON E.EmployeeID = EE.EmployeeID
JOIN Equipment EQ ON EE.EquipmentID = EQ.EquipmentID
GROUP BY E.EmployeeID
ORDER BY E.EmployeeID;

 * sqlite:////Users/HP/OneDrive/Desktop/SQL/Worker.db
Done.

[(1, 1000), (2, 2500), (3, 2700), (4, 1200), (5, 2700), (6, 2500)]

#### 4. Write a query to display the EmployeeID and total EquipmentCostAmount for each employee who incurs a total EquipmentCostAmount of more than $300.

#### Sort the results by EmployeeID. (Use Employee, EmployeeEquipment, Equipment tables). [Hints: use HAVING clause].

In [10]:
%%sql

SELECT E.EmployeeID, SUM(EQ.EquipmentCostAmount) AS TotalEquipmentCost
FROM Employee E
JOIN EmployeeEquipment EE ON E.EmployeeID = EE.EmployeeID
JOIN Equipment EQ ON EE.EquipmentID = EQ.EquipmentID
GROUP BY E.EmployeeID
HAVING TotalEquipmentCost > 300
ORDER BY E.EmployeeID;

 * sqlite:////Users/HP/OneDrive/Desktop/SQL/Worker.db
Done.

[(1, 1000), (2, 2500), (3, 2700), (4, 1200), (5, 2700), (6, 2500)]

#### 5. Write a query to display the EquipmentID, and the first 10 characters of EquipmentName [Hints: use SUBSTR/SUBSTRING]. Sort the results by EquipmentID.

In [11]:
%%sql

SELECT EquipmentID, SUBSTR(EquipmentName, 1, 10) AS ShortEquipmentName
FROM Equipment
ORDER BY EquipmentID;

 * sqlite:////Users/HP/OneDrive/Desktop/SQL/Worker.db
Done.

[(1, 'Notebook C'),
 (2, 'Headsets'),
 (3, 'Computer M'),
 (4, 'Multi-Func'),
 (5, 'Projector '),
 (6, 'Servers'),
 (7, 'Internet M'),
 (8, 'Cell Phone')]

#### 6. Write a query to display the complete list of Training, and trainers (first and last name) available for each training. If the trainer's last name is not available, display a default value of 'TBD' by using the CASE Expression in the SQL. Sort the output by TrainingName and Trainers' first name.

In [13]:
%%sql

SELECT t.TrainingName,
    tt.TrainerFirstName,
    CASE
        WHEN tt.TrainerLastName IS NULL THEN 'TBD'
        ELSE tt.TrainerLastName
END AS TrainerLastName
FROM Training AS t
LEFT JOIN Trainer AS tt ON t.TrainingID = tt.TrainingID
ORDER BY t.TrainingName, tt.TrainerFirstName;

 * sqlite:////Users/HP/OneDrive/Desktop/SQL/Worker.db
Done.

[('COVID-19 Awareness and Protection Training', 'James', 'Smith'),
 ('COVID-19 Awareness and Protection Training', 'Johnny', 'Khor'),
 ('Code of Conduct Training', 'Michael', 'Smith'),
 ('Employee Relations', 'Mary', 'Garcia'),
 ('Employee Relations', 'Vanessa', 'TBD'),
 ('Intro to Python', 'John', 'TBD'),
 ('Intro to Python', 'Paul', 'Deitel'),
 ('Machine Learning', 'Avinash', 'Navlani'),
 ('Machine Learning', 'Mike', 'Taylor'),
 ('Microsoft Certifications', 'Robert', 'Smith'),
 ('Product Knowledge', 'Mike', 'Donlon'),
 ('Safety Training', 'Maria', 'Garcia'),
 ('Sales Skills', 'Kathy', 'Corby'),
 ('Security and Privacy', 'Maria', 'Rodriguez'),
 ('Travel and Expense Management', 'Jordan', 'TBD'),
 ('Travel and Expense Management', 'Maria', 'Hernandez')]

#### 7. Write a query to display the complete list of Training, and trainers (first and last name) available for each training. If the trainer's last name is not available, display a default value of 'TBD' by using the COALESCE function in the SQL. Sort the output by TrainingName and Trainers' first name.

In [14]:
%%sql

SELECT t.TrainingName,
    COALESCE(tt.TrainerFirstName, 'TBD') AS TrainerFirstName,
    COALESCE(tt.TrainerLastName, 'TBD') AS TrainerLastName
FROM Training AS t
LEFT JOIN Trainer AS tt ON t.TrainingID = tt.TrainingID
ORDER BY t.TrainingName, COALESCE(tt.TrainerFirstName, 'TBD'),
COALESCE(tt.TrainerLastName, 'TBD');

 * sqlite:////Users/HP/OneDrive/Desktop/SQL/Worker.db
Done.

[('COVID-19 Awareness and Protection Training', 'James', 'Smith'),
 ('COVID-19 Awareness and Protection Training', 'Johnny', 'Khor'),
 ('Code of Conduct Training', 'Michael', 'Smith'),
 ('Employee Relations', 'Mary', 'Garcia'),
 ('Employee Relations', 'Vanessa', 'TBD'),
 ('Intro to Python', 'John', 'TBD'),
 ('Intro to Python', 'Paul', 'Deitel'),
 ('Machine Learning', 'Avinash', 'Navlani'),
 ('Machine Learning', 'Mike', 'Taylor'),
 ('Microsoft Certifications', 'Robert', 'Smith'),
 ('Product Knowledge', 'Mike', 'Donlon'),
 ('Safety Training', 'Maria', 'Garcia'),
 ('Sales Skills', 'Kathy', 'Corby'),
 ('Security and Privacy', 'Maria', 'Rodriguez'),
 ('Travel and Expense Management', 'Jordan', 'TBD'),
 ('Travel and Expense Management', 'Maria', 'Hernandez')]

#### 8. Write a query using EXISTS operator to display the EmployeeID, FirstName, LastName, and HireDate of employees who work for the following departments: Accounting and Finance, IT Support, and Production. Sort the results by EmployeeID.

In [15]:
%%sql

SELECT E.EmployeeID, E.FirstName, E.LastName, E.HireDate
FROM Employee E
WHERE EXISTS (
    SELECT 1
    FROM Department D
    WHERE E.DepartmentID = D.DepartmentID
    AND D.DepartmentNm IN ('Accounting and Finance', 'IT Support', 'Production')
)
ORDER BY E.EmployeeID;

 * sqlite:////Users/HP/OneDrive/Desktop/SQL/Worker.db
Done.

[(1, 'Andy', 'Wong', '2001-01-15'),
 (3, 'Vivek', 'Pandey', '2003-11-15'),
 (6, 'Tom', 'Harper', '2010-04-11')]

#### 9. Write a query using EXCEPT operator to display the EmployeeID, FirstName, LastName, and HireDate of employees who do NOT work for the following departments: Accounting and Finance, IT Support, and Production. You must use these filters in your SQL. Sort the results by EmployeeID.

#### NOTE: In case your database does not support EXCEPT operator, you may consider NOT EXIST operator.

In [16]:
%%sql

SELECT E.EmployeeID, E.FirstName, E.LastName, E.HireDate
FROM Employee E
WHERE NOT EXISTS (
    SELECT 1
    FROM Department D
    WHERE E.DepartmentID = D.DepartmentID
    AND D.DepartmentNm IN ('Accounting and Finance', 'IT Support', 'Production')
)
ORDER BY E.EmployeeID;

 * sqlite:////Users/HP/OneDrive/Desktop/SQL/Worker.db
Done.

[(2, 'John', 'Wilson', '2017-03-19'),
 (4, 'Nola', 'Davis', '2016-03-23'),
 (5, 'Kathy', 'Cooper', '2011-11-18')]

#### 10. Write a query using the MINUS operator to display the distinct list of equipment NOT used by the current employees.

#### NOTE: In case your database does not support MINUS operator, you may consider NOT IN operator.

In [17]:
%%sql

SELECT EquipmentID, EquipmentName
FROM Equipment
WHERE EquipmentID NOT IN (
    SELECT DISTINCT EquipmentID
    FROM EmployeeEquipment
)
ORDER BY EquipmentID;

 * sqlite:////Users/HP/OneDrive/Desktop/SQL/Worker.db
Done.

[(4, 'Multi-Function Printers'),
 (5, 'Projector or a Big Screen TV'),
 (6, 'Servers'),
 (7, 'Internet Modem'),
 (8, 'Cell Phone')]